In [1]:
# 데이터 병합 concat
import pandas as pd

In [10]:
data_01 = {'고객 ID' : ['1', '2', '3'],
           '이름' : ['John', 'Mike', 'Sarah'],
           '나이' : [25, 35, 30]}

data_02 = {'고객 ID' : ['4', '5', '6'],
           '이름' : ['Adam', 'Kim', 'Park'],
           '나이' : [22, 17, 32]}

df_01 = pd.DataFrame(data_01)
df_02 = pd.DataFrame(data_02)

In [14]:
# concat() 함수
concatenated_df = pd.concat([df_01, df_02], axis = 0)

concatenated_df

  고객 ID     이름  나이
0     1   John  25
1     2   Mike  35
2     3  Sarah  30
0     4   Adam  22
1     5    Kim  17
2     6   Park  32

In [31]:
# Merging() 함수 활용도는 낮다.

data_01 = {'고객 ID' : ['1', '2', '3'],
           '이름' : ['John', 'Mike', 'Sarah'],
           '나이' : [25, 35, 30]}

data_02 = {'고객 ID' : ['2', '3', '4'],
           '주소' : ['NY', 'LA', 'FL']}

df_01 = pd.DataFrame(data_01)
df_02 = pd.DataFrame(data_02)

# 공백은 NaN으로 채워진다.
merged_df = pd.merge(df_01, df_02, on = '고객 ID', how = 'inner') # how 인자 default는 inner : 교집합
# merged_df = pd.merge(df_01, df_02, on = '고객 ID', how = 'outer') # outer : 합집합
# merged_df = pd.merge(df_01, df_02, on = '고객 ID', how = 'left') # left 왼쪽 Data 기준으로 
# merged_df = pd.merge(df_01, df_02, on = '고객 ID', how = 'right') # right 오른쪽 Data 기준으로

merged_df

  고객 ID     이름  나이  주소
0     2   Mike  35  NY
1     3  Sarah  30  LA

In [38]:
# Join() 함수 

data_01 = {'고객 ID' : ['1', '2', '3'],
           '이름' : ['John', 'Mike', 'Sarah'],
           '나이' : [25, 35, 30]}

data_02 = {'주소' : ['NY', 'LA', 'FL'],
           '직업' : ['학생', '회사원', '교사']}

df_01 = pd.DataFrame(data_01)
df_02 = pd.DataFrame(data_02)


concatenated_df = pd.concat([df_01, df_02], axis = 1)

print(concatenated_df)


joined_df = df_01.join(df_02)

print(joined_df)

  고객 ID     이름  나이  주소   직업
0     1   John  25  NY   학생
1     2   Mike  35  LA  회사원
2     3  Sarah  30  FL   교사
  고객 ID     이름  나이  주소   직업
0     1   John  25  NY   학생
1     2   Mike  35  LA  회사원
2     3  Sarah  30  FL   교사

In [39]:
# pivot() 함수 축을 기준으로 회전

data = {'학년' : ['1학년', '1학년', '2학년', '2학년'],
        '과목' : ['수학', '영어', '수학', '영어'],
        '점수' : [80, 90, 70, 85]}

df = pd.DataFrame(data)

df

    학년  과목  점수
0  1학년  수학  80
1  1학년  영어  90
2  2학년  수학  70
3  2학년  영어  85

In [40]:
pivot_df = df.pivot(index = '학년', columns = '과목', values = '점수')

pivot_df

과목   수학  영어
학년
1학년  80  90
2학년  70  85

In [41]:
pivot_df = df.pivot(index = '과목', columns = '학년', values = '점수')

pivot_df

학년  1학년  2학년
과목
수학   80   70
영어   90   85